app/views/watchlists/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."watchlist_id" = ?  [["watchlist_id", 16]]
---

  <% @watchlist.movies.each.with_index do |movie| %>