app/views/watchlists/sorted_watchlist.html.erb

SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---

  <h2><%= @movies.first.watchlist.name %></h2>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  <div >
    <%= button_to "Back to lists", user_watchlists_path(@movies.first.watchlist.user), :method => "get", class: "btn btn-outline-info"%>