app/controllers/movies_controller.rb

  def index
    if params[:search]
      @movies = Movie.search(params[:search])
---
SELECT "movies".* FROM "movies"

  def new
    @watchlist = Watchlist.find_by_id(params[:watchlist_id])
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def create
    @movie = Movie.new(movie_params)
    @watchlist = Watchlist.find_by_id(params[:movie][:watchlist_id])
    if @movie.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "genre", "description", "year", "watchlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["genre", "test"], ["description", "test"], ["year", 2019], ["watchlist_id", 1], ["created_at", "2020-10-09 01:30:28.398270"], ["updated_at", "2020-10-09 01:30:28.398270"]]

  def update
    @movie.update(movie_params)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", ""], ["updated_at", "2020-06-07 03:38:36.332530"], ["id", 21]]

  def destroy
    Movie.destroy(params[:id])
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 52]]

  def set_movie
    @movie = Movie.find_by(id: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]