app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bajwahassan@outlook.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?, ?)
---
  def create_by_facebook
    @user = User.find_by(email: auth[:info][:email])
    if @user
      session[:user_id] = @user.id
      redirect_to user_watchlists_path(@user)
    else
      @user = User.create(name: auth[:info][:name], email: auth[:info][:email], uid: auth[:uid], password_digest: SecureRandom.hex)