app/controllers/watchlists_controller.rb

INSERT INTO "watchlists" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "action movies"], ["description", "movies between 2010 - 2019"], ["user_id", 12], ["created_at", "2020-06-07 03:32:15.468800"], ["updated_at", "2020-06-07 03:32:15.468800"]]
---
  def create
    @watchlist = current_user.watchlists.build(watchlist_params)
    if @watchlist.save

SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def show
    @watchlist = Watchlist.find_by_id(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."watchlist_id" = ? ORDER BY year desc  [["watchlist_id", 14]]
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def sort_year
    @movies = Watchlist.find_by_id(params[:format]).movies.by_year