app/models/movie.rb

SELECT "movies".* FROM "movies" WHERE "movies"."genre" = ? LIMIT ?  [["genre", "animation"], ["LIMIT", 1]]
---
  def self.search(genre)
    movies_by_genre = Movie.where(genre: genre)